{
    "id": "b0e69a9a6c20494f3d31a7f2f1adc3df",
    "metadata": {
        "id": "b0e69a9a6c20494f3d31a7f2f1adc3df",
        "url": "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/migration-guide/migration-zero-twenty",
        "title": "Migration guide 0.13.2 → 0.20.0 | ZenML - Bridging the gap between ML & Ops",
        "properties": {
            "description": "How to migrate from ZenML <=0.13.2 to 0.20.0.",
            "keywords": null,
            "author": null,
            "og:title": "Migration guide 0.13.2 → 0.20.0 | ZenML - Bridging the gap between ML & Ops",
            "og:description": "How to migrate from ZenML <=0.13.2 to 0.20.0.",
            "og:image": "https://docs.zenml.io/~gitbook/ogimage/XeyQ2orC0RSBQmElFbfq",
            "twitter:card": "summary_large_image",
            "twitter:title": "Migration guide 0.13.2 → 0.20.0 | ZenML - Bridging the gap between ML & Ops",
            "twitter:description": "How to migrate from ZenML <=0.13.2 to 0.20.0.",
            "twitter:image": "https://docs.zenml.io/~gitbook/ogimage/XeyQ2orC0RSBQmElFbfq"
        }
    },
    "content": "`⌘``k`\nGitBook AssistantAsk\nProductResourcesGitHubStart free\nMore\n  * Documentation\n  * Learn\n  * ZenML Pro\n  * Stacks\n  * API Reference\n  * SDK Reference\n  * Changelog\n\n\nGitBook Assistant\nGitBook Assistant\nWorking...Thinking...\nGitBook Assistant\n##### Good afternoon\nI'm here to help you with the docs.\nWhat is this page about?What should I read next?Can you give an example?\n`⌘``i`\nAI Based on your context\nSend\n  * Getting Started\n    *     *     *     *     *     *   * Deploying ZenML\n    *     *     *       * Best practices for upgrading\n      * Using ZenML server in production\n      * Troubleshoot your ZenML server\n      * Migration guide\n        * Migration guide 0.13.2 → 0.20.0\n        * Migration guide 0.23.0 → 0.30.0\n        * Migration guide 0.39.1 → 0.41.0\n        * Migration guide 0.58.2 → 0.60.0\n  * Concepts\n    *     *     *     *     *     *     *     *     *     *     *     *     *     *     *   * Reference\n    *     *     *     *     *     * \n\nPowered by GitBook\n  * ZenML takes over the Metadata Store role\n  * 👣 How to migrate pipeline runs from your old metadata stores\n  * 💾 The New Way (CLI Command Cheat Sheet)\n  * The ZenML Dashboard is now available\n  * Removal of Profiles and the local YAML database\n  * 👣 How to migrate your Profiles\n  * Decoupling Stack Component configuration from implementation\n  * Shared ZenML Stacks and Stack Components\n  * Other changes\n  * The Repository class is now called Client\n  * The BaseStepConfig class is now called BaseParameters\n  * Configuration Rework\n  * PipelineSpec now uniquely defines pipelines\n  * New post-execution workflow\n  * 📡Future Changes\n  * 🐞 Reporting Bugs\n\n\nWas this helpful?\nGitBook AssistantAsk\n  1. Deploying ZenML\n  2.   3. Migration guide\n\n\n# Migration guide 0.13.2 → 0.20.0\nHow to migrate from ZenML <=0.13.2 to 0.20.0.\n_Last updated: 2023-07-24_\nThe ZenML 0.20.0 release brings a number of big changes to its architecture and its features, some of which are not backwards compatible with previous versions. This guide walks you through these changes and offers instructions on how to migrate your existing ZenML stacks and pipelines to the new version with minimal effort and disruption to your existing workloads.\nUpdating to ZenML 0.20.0 needs to be followed by a migration of your existing ZenML Stacks and you may also need to make changes to your current ZenML pipeline code. Please read this guide carefully and follow the migration instructions to ensure a smooth transition.\nIf you have updated to ZenML 0.20.0 by mistake or are experiencing issues with the new version, you can always go back to the previous version by using `pip install zenml==0.13.2` instead of `pip install zenml` when installing ZenML manually or in your scripts.\nHigh-level overview of the changes:\n  * ZenML takes over the Metadata Store role. All information about your ZenML Stacks, pipelines, and artifacts is tracked by ZenML itself directly. If you are currently using remote Metadata Stores (e.g. deployed in cloud) in your stacks, you will probably need to replace them with a ZenML server deployment.\n  * the new ZenML Dashboard is now available with all ZenML deployments.\n  * ZenML Profiles have been removed in favor of ZenML Projects. You need to manually migrate your existing ZenML Profiles after the update.\n  * the configuration of Stack Components is now decoupled from their implementation. If you extended ZenML with custom stack component implementations, you may need to update the way they are registered in ZenML.\n  * the updated ZenML server provides a new and improved collaborative experience. When connected to a ZenML server, you can now share your ZenML Stacks and Stack Components with other users. If you were previously using the ZenML Profiles or the ZenML server to share your ZenML Stacks, you should switch to the new ZenML server and Dashboard and update your existing workflows to reflect the new features.\n\n\n## \nZenML takes over the Metadata Store role\nZenML can now run as a server that can be accessed via a REST API and also comes with a visual user interface (called the ZenML Dashboard). This server can be deployed in arbitrary environments (local, on-prem, via Docker, on AWS, GCP, Azure etc.) and supports user management, workspace scoping, and more.\nThe release introduces a series of commands to facilitate managing the lifecycle of the ZenML server and to access the pipeline and pipeline run information:\n  * `zenml connect / disconnect / down / up / logs / status` can be used to configure your client to connect to a ZenML server, to start a local ZenML Dashboard or to deploy a ZenML server to a cloud environment. For more information on how to use these commands, see the ZenML deployment documentation.\n  * `zenml pipeline list / runs / delete` can be used to display information and about and manage your pipelines and pipeline runs.\n\n\nIn ZenML 0.13.2 and earlier versions, information about pipelines and pipeline runs used to be stored in a separate stack component called the Metadata Store. Starting with 0.20.0, the role of the Metadata Store is now taken over by ZenML itself. This means that the Metadata Store is no longer a separate component in the ZenML architecture, but rather a part of the ZenML core, located wherever ZenML is deployed: locally on your machine or running remotely as a server.\nAll metadata is now stored, tracked, and managed by ZenML itself. The Metadata Store stack component type and all its implementations have been deprecated and removed. It is no longer possible to register them or include them in ZenML stacks. This is a key architectural change in ZenML 0.20.0 that further improves usability, reproducibility and makes it possible to visualize and manage all your pipelines and pipeline runs in the new ZenML Dashboard.\nThe architecture changes for the local case are shown in the diagram below:\nZenML local metadata before 0.20.0\nZenML local metadata after 0.20.0\nThe architecture changes for the remote case are shown in the diagram below:\nZenML remote metadata before 0.20.0\nZenML remote metadata after 0.20.0\nIf you're already using ZenML, aside from the above limitation, this change will impact you differently, depending on the flavor of Metadata Stores you have in your stacks:\n  * if you're using the default `sqlite` Metadata Store flavor in your stacks, you don't need to do anything. ZenML will automatically switch to using its local database instead of your `sqlite` Metadata Stores when you update to 0.20.0 (also see how to migrate your stacks).\n  * if you're using the `kubeflow` Metadata Store flavor _only as a way to connect to the local Kubeflow Metadata Service_ (i.e. the one installed by the `kubeflow` Orchestrator in a local k3d Kubernetes cluster), you also don't need to do anything explicitly. When you migrate your stacks to ZenML 0.20.0, ZenML will automatically switch to using its local database.\n  * if you're using the `kubeflow` Metadata Store flavor to connect to a remote Kubeflow Metadata Service such as those provided by a Kubeflow installation running in AWS, Google or Azure, there is currently no equivalent in ZenML 0.20.0. You'll need to deploy a ZenML Server instance close to where your Kubeflow service is running (e.g. in the same cloud region).\n  * if you're using the `mysql` Metadata Store flavor to connect to a remote MySQL database service (e.g. a managed AWS, GCP or Azure MySQL service), you'll have to deploy a ZenML Server instance connected to that same database.\n  * if you deployed a `kubernetes` Metadata Store flavor (i.e. a MySQL database service deployed in Kubernetes), you can deploy a ZenML Server in the same Kubernetes cluster and connect it to that same database. However, ZenML will no longer provide the `kubernetes` Metadata Store flavor and you'll have to manage the Kubernetes MySQL database service deployment yourself going forward.\n\n\nThe ZenML Server inherits the same limitations that the Metadata Store had prior to ZenML 0.20.0:\n  * it is not possible to use a local ZenML Server to track pipelines and pipeline runs that are running remotely in the cloud, unless the ZenML server is explicitly configured to be reachable from the cloud (e.g. by using a public IP address or a VPN connection).\n  * using a remote ZenML Server to track pipelines and pipeline runs that are running locally is possible, but can have significant performance issues due to the network latency.\n\n\nIt is therefore recommended that you always use a ZenML deployment that is located as close as possible to and reachable from where your pipelines and step operators are running. This will ensure the best possible performance and usability.\n### \n👣 How to migrate pipeline runs from your old metadata stores\nThe `zenml pipeline runs migrate` CLI command is only available under ZenML versions [0.21.0, 0.21.1, 0.22.0]. If you want to migrate your existing ZenML runs from `zenml<0.20.0` to `zenml>0.22.0`, please first upgrade to `zenml==0.22.0` and migrate your runs as shown below, then upgrade to the newer version.\nTo migrate the pipeline run information already stored in an existing metadata store to the new ZenML paradigm, you can use the `zenml pipeline runs migrate` CLI command.\n  1. Before upgrading ZenML, make a backup of all metadata stores you want to migrate, then upgrade ZenML.\n  2. Decide the ZenML deployment model that you want to follow for your projects. See the ZenML deployment documentation for available deployment scenarios. If you decide on using a local or remote ZenML server to manage your pipelines, make sure that you first connect your client to it by running `zenml connect`.\n  3. Use the `zenml pipeline runs migrate` CLI command to migrate your old pipeline runs:\n\n\n  * If you want to migrate from a local SQLite metadata store, you only need to pass the path to the metadata store to the command, e.g.:\n\n\nCopy```\nzenml pipeline runs migrate PATH/TO/LOCAL/STORE/metadata.db\n```\n\n  * If you would like to migrate any other store, you will need to set `--database_type=mysql` and provide the MySQL host, username, and password in addition to the database, e.g.:\n\n\nCopy```\nzenml pipeline runs migrate DATABASE_NAME \\\n  --database_type=mysql \\\n  --mysql_host=URL/TO/MYSQL \\\n  --mysql_username=MYSQL_USERNAME \\\n  --mysql_password=MYSQL_PASSWORD\n```\n\n### \n💾 The New Way (CLI Command Cheat Sheet)\n**Deploy the server**\n`zenml deploy --aws` (maybe don't do this :) since it spins up infrastructure on AWS…)\n**Spin up a local ZenML Server**\n`zenml up`\n**Connect to a pre-existing server**\n`zenml connect` (pass in URL / etc, or zenml connect --config + yaml file)\n**List your deployed server details**\n`zenml status`\n## \nThe ZenML Dashboard is now available\nThe new ZenML Dashboard is now bundled into the ZenML Python package and can be launched directly from Python. The source code lives in the ZenML Dashboard repository.\nTo launch it locally, simply run `zenml up` on your machine and follow the instructions:\nCopy```\n$ zenml up\nDeploying a local ZenML server with name 'local'.\nConnecting ZenML to the 'local' local ZenML server (http://127.0.0.1:8237).\nUpdated the global store configuration.\nConnected ZenML to the 'local' local ZenML server (http://127.0.0.1:8237).\nThe local ZenML dashboard is available at 'http://127.0.0.1:8237'. You can\nconnect to it using the 'default' username and an empty password.\n```\n\nThe Dashboard will be available at `http://localhost:8237` by default:\nZenML Dashboard Preview\nFor more details on other possible deployment options, see the ZenML deployment documentation, and/or follow the starter guide to learn more.\n## \nRemoval of Profiles and the local YAML database\nPrior to 0.20.0, ZenML used used a set of local YAML files to store information about the Stacks and Stack Components that were registered on your machine. In addition to that, these Stacks could be grouped together and organized under individual Profiles.\nProfiles and the local YAML database have both been deprecated and removed in ZenML 0.20.0. Stack, Stack Components as well as all other information that ZenML tracks, such as Pipelines and Pipeline Runs, are now stored in a single SQL database. These entities are no longer organized into Profiles, but they can be scoped into different Projects instead.\nSince the local YAML database is no longer used by ZenML 0.20.0, you will lose all the Stacks and Stack Components that you currently have configured when you update to ZenML 0.20.0. If you still want to use these Stacks, you will need to manually migrate them after the update.\n### \n👣 How to migrate your Profiles\nIf you're already using ZenML, you can migrate your existing Profiles to the new ZenML 0.20.0 paradigm by following these steps:\n  1. first, update ZenML to 0.20.0. This will automatically invalidate all your existing Profiles.\n  2. decide the ZenML deployment model that you want to follow for your projects. See the ZenML deployment documentation for available deployment scenarios. If you decide on using a local or remote ZenML server to manage your pipelines, make sure that you first connect your client to it by running `zenml connect`.\n  3. use the `zenml profile list` and `zenml profile migrate` CLI commands to import the Stacks and Stack Components from your Profiles into your new ZenML deployment. If you have multiple Profiles that you would like to migrate, you can either use a prefix for the names of your imported Stacks and Stack Components, or you can use a different ZenML Project for each Profile.\n\n\nThe ZenML Dashboard is currently limited to showing only information that is available in the `default` Project. If you wish to migrate your Profiles to a different Project, you will not be able to visualize the migrated Stacks and Stack Components in the Dashboard. This will be fixed in a future release.\nOnce you've migrated all your Profiles, you can delete the old YAML files.\nExample of migrating a `default` profile into the `default` project:\nCopy```\n$ zenml profile list\nZenML profiles have been deprecated and removed in this version of ZenML. All\nstacks, stack components, flavors etc. are now stored and managed globally,\neither in a local database or on a remote ZenML server (see the `zenml up` and\n`zenml connect` commands). As an alternative to profiles, you can use projects\nas a scoping mechanism for stacks, stack components and other ZenML objects.\nThe information stored in legacy profiles is not automatically migrated. You can\ndo so manually by using the `zenml profile list` and `zenml profile migrate` commands.\nFound profile with 1 stacks, 3 components and 0 flavors at: /home/stefan/.config/zenml/profiles/default\nFound profile with 3 stacks, 6 components and 0 flavors at: /home/stefan/.config/zenml/profiles/zenprojects\nFound profile with 3 stacks, 7 components and 0 flavors at: /home/stefan/.config/zenml/profiles/zenbytes\n$ zenml profile migrate /home/stefan/.config/zenml/profiles/default\nNo component flavors to migrate from /home/stefan/.config/zenml/profiles/default/stacks.yaml...\nMigrating stack components from /home/stefan/.config/zenml/profiles/default/stacks.yaml...\nCreated artifact_store 'cloud_artifact_store' with flavor 's3'.\nCreated container_registry 'cloud_registry' with flavor 'aws'.\nCreated container_registry 'local_registry' with flavor 'default'.\nCreated model_deployer 'eks_seldon' with flavor 'seldon'.\nCreated orchestrator 'cloud_orchestrator' with flavor 'kubeflow'.\nCreated orchestrator 'kubeflow_orchestrator' with flavor 'kubeflow'.\nCreated secrets_manager 'aws_secret_manager' with flavor 'aws'.\nMigrating stacks from /home/stefan/.config/zenml/profiles/v/stacks.yaml...\nCreated stack 'cloud_kubeflow_stack'.\nCreated stack 'local_kubeflow_stack'.\n$ zenml stack list\nUsing the default local database.\nRunning with active project: 'default' (global)\n┏━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━┯━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━┓\n┃ ACTIVE │ STACK NAME           │ STACK ID                             │ SHARED │ OWNER   │ CONTAINER_REGISTRY │ ARTIFACT_STORE       │ ORCHESTRATOR          │ MODEL_DEPLOYER │ SECRETS_MANAGER    ┃\n┠────────┼──────────────────────┼──────────────────────────────────────┼────────┼─────────┼────────────────────┼──────────────────────┼───────────────────────┼────────────────┼────────────────────┨\n┃        │ local_kubeflow_stack │ 067cc6ee-b4da-410d-b7ed-06da4c983145 │        │ default │ local_registry     │ default              │ kubeflow_orchestrator │                │                    ┃\n┠────────┼──────────────────────┼──────────────────────────────────────┼────────┼─────────┼────────────────────┼──────────────────────┼───────────────────────┼────────────────┼────────────────────┨\n┃        │ cloud_kubeflow_stack │ 054f5efb-9e80-48c0-852e-5114b1165d8b │        │ default │ cloud_registry     │ cloud_artifact_store │ cloud_orchestrator    │ eks_seldon     │ aws_secret_manager ┃\n┠────────┼──────────────────────┼──────────────────────────────────────┼────────┼─────────┼────────────────────┼──────────────────────┼───────────────────────┼────────────────┼────────────────────┨\n┃   👉   │ default              │ fe913bb5-e631-4d4e-8c1b-936518190ebb │        │ default │                    │ default              │ default               │                │                    ┃\n┗━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━┷━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━┛\n```\n\nExample of migrating a profile into the `default` project using a name prefix:\nCopy```\n$ zenml profile migrate /home/stefan/.config/zenml/profiles/zenbytes --prefix zenbytes_\nNo component flavors to migrate from /home/stefan/.config/zenml/profiles/zenbytes/stacks.yaml...\nMigrating stack components from /home/stefan/.config/zenml/profiles/zenbytes/stacks.yaml...\nCreated artifact_store 'zenbytes_s3_store' with flavor 's3'.\nCreated container_registry 'zenbytes_ecr_registry' with flavor 'default'.\nCreated experiment_tracker 'zenbytes_mlflow_tracker' with flavor 'mlflow'.\nCreated experiment_tracker 'zenbytes_mlflow_tracker_local' with flavor 'mlflow'.\nCreated model_deployer 'zenbytes_eks_seldon' with flavor 'seldon'.\nCreated model_deployer 'zenbytes_mlflow' with flavor 'mlflow'.\nCreated orchestrator 'zenbytes_eks_orchestrator' with flavor 'kubeflow'.\nCreated secrets_manager 'zenbytes_aws_secret_manager' with flavor 'aws'.\nMigrating stacks from /home/stefan/.config/zenml/profiles/zenbytes/stacks.yaml...\nCreated stack 'zenbytes_aws_kubeflow_stack'.\nCreated stack 'zenbytes_local_with_mlflow'.\n$ zenml stack list\nUsing the default local database.\nRunning with active project: 'default' (global)\n┏━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━┯━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┓\n┃ ACTIVE │ STACK NAME           │ STACK ID             │ SHARED │ OWNER   │ ORCHESTRATOR          │ ARTIFACT_STORE    │ CONTAINER_REGISTRY   │ SECRETS_MANAGER       │ MODEL_DEPLOYER      │ EXPERIMENT_TRACKER   ┃\n┠────────┼──────────────────────┼──────────────────────┼────────┼─────────┼───────────────────────┼───────────────────┼──────────────────────┼───────────────────────┼─────────────────────┼──────────────────────┨\n┃        │ zenbytes_aws_kubeflo │ 9fe90f0b-2a79-47d9-8 │        │ default │ zenbytes_eks_orchestr │ zenbytes_s3_store │ zenbytes_ecr_registr │ zenbytes_aws_secret_m │ zenbytes_eks_seldon │                      ┃\n┃        │ w_stack              │ f80-04e45ff02cdb     │        │         │ ator                  │                   │ y                    │ manager                │                     │                      ┃\n┠────────┼──────────────────────┼──────────────────────┼────────┼─────────┼───────────────────────┼───────────────────┼──────────────────────┼───────────────────────┼─────────────────────┼──────────────────────┨\n┃   👉   │ default              │ 7a587e0c-30fd-402f-a │        │ default │ default               │ default           │                      │                       │                     │                      ┃\n┃        │                      │ 3a8-03651fe1458f     │        │         │                       │                   │                      │                       │                     │                      ┃\n┠────────┼──────────────────────┼──────────────────────┼────────┼─────────┼───────────────────────┼───────────────────┼──────────────────────┼───────────────────────┼─────────────────────┼──────────────────────┨\n┃        │ zenbytes_local_with_ │ c2acd029-8eed-4b6e-a │        │ default │ default               │ default           │                      │                       │ zenbytes_mlflow     │ zenbytes_mlflow_trac ┃\n┃        │ mlflow               │ d19-91c419ce91d4     │        │         │                       │                   │                      │                       │                     │ ker                  ┃\n┗━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━┷━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┛\n```\n\nExample of migrating a profile into a new project:\nCopy```\n$ zenml profile migrate /home/stefan/.config/zenml/profiles/zenprojects --project zenprojects\nUnable to find ZenML repository in your current working directory (/home/stefan/aspyre/src/zenml) or any parent directories. If you want to use an existing repository which is in a different location, set the environment variable 'ZENML_REPOSITORY_PATH'. If you want to create a new repository, run zenml init.\nRunning without an active repository root.\nCreating project zenprojects\nCreating default stack for user 'default' in project zenprojects...\nNo component flavors to migrate from /home/stefan/.config/zenml/profiles/zenprojects/stacks.yaml...\nMigrating stack components from /home/stefan/.config/zenml/profiles/zenprojects/stacks.yaml...\nCreated artifact_store 'cloud_artifact_store' with flavor 's3'.\nCreated container_registry 'cloud_registry' with flavor 'aws'.\nCreated container_registry 'local_registry' with flavor 'default'.\nCreated model_deployer 'eks_seldon' with flavor 'seldon'.\nCreated orchestrator 'cloud_orchestrator' with flavor 'kubeflow'.\nCreated orchestrator 'kubeflow_orchestrator' with flavor 'kubeflow'.\nCreated secrets_manager 'aws_secret_manager' with flavor 'aws'.\nMigrating stacks from /home/stefan/.config/zenml/profiles/zenprojects/stacks.yaml...\nCreated stack 'cloud_kubeflow_stack'.\nCreated stack 'local_kubeflow_stack'.\n$ zenml project set zenprojects\nCurrently the concept of `project` is not supported within the Dashboard. The Project functionality will be completed in the coming weeks. For the time being it is recommended to stay within the `default` \nproject.\nUsing the default local database.\nRunning with active project: 'default' (global)\nSet active project 'zenprojects'.\n$ zenml stack list\nUsing the default local database.\nRunning with active project: 'zenprojects' (global)\nThe current global active stack is not part of the active project. Resetting the active stack to default.\nYou are running with a non-default project 'zenprojects'. Any stacks, components, pipelines and pipeline runs produced in this project will currently not be accessible through the dashboard. However, this will be possible in the near future.\n┏━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━┯━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━┯━━━━━━━━━━━━━━━━━━━━┓\n┃ ACTIVE │ STACK NAME           │ STACK ID                             │ SHARED │ OWNER   │ ARTIFACT_STORE       │ ORCHESTRATOR          │ MODEL_DEPLOYER │ CONTAINER_REGISTRY │ SECRETS_MANAGER    ┃\n┠────────┼──────────────────────┼──────────────────────────────────────┼────────┼─────────┼──────────────────────┼───────────────────────┼────────────────┼────────────────────┼────────────────────┨\n┃   👉   │ default              │ 3ea77330-0c75-49c8-b046-4e971f45903a │        │ default │ default              │ default               │                │                    │                    ┃\n┠────────┼──────────────────────┼──────────────────────────────────────┼────────┼─────────┼──────────────────────┼───────────────────────┼────────────────┼────────────────────┼────────────────────┨\n┃        │ cloud_kubeflow_stack │ b94df4d2-5b65-4201-945a-61436c9c5384 │        │ default │ cloud_artifact_store │ cloud_orchestrator    │ eks_seldon     │ cloud_registry     │ aws_secret_manager ┃\n┠────────┼──────────────────────┼──────────────────────────────────────┼────────┼─────────┼──────────────────────┼───────────────────────┼────────────────┼────────────────────┼────────────────────┨\n┃        │ local_kubeflow_stack │ 8d9343ac-d405-43bd-ab9c-85637e479efe │        │ default │ default              │ kubeflow_orchestrator │                │ local_registry     │                    ┃\n┗━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━┷━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━┷━━━━━━━━━━━━━━━━━━━━┛\n```\n\nThe `zenml profile migrate` CLI command also provides command line flags for cases in which the user wants to overwrite existing components or stacks, or ignore errors.\n## \nDecoupling Stack Component configuration from implementation\nStack components can now be registered without having the required integrations installed. As part of this change, we split all existing stack component definitions into three classes: an implementation class that defines the logic of the stack component, a config class that defines the attributes and performs input validations, and a flavor class that links implementation and config classes together. See **component flavor models #895** for more details.\nIf you are only using stack component flavors that are shipped with the zenml Python distribution, this change has no impact on the configuration of your existing stacks. However, if you are currently using custom stack component implementations, you will need to update them to the new format. See the documentation on writing custom stack component flavors for updated information on how to do this.\n## \nShared ZenML Stacks and Stack Components\nWith collaboration being the key part of ZenML, the 0.20.0 release puts the concepts of Users in the front and center and introduces the possibility to share stacks and stack components with other users by means of the ZenML server.\nWhen your client is connected to a ZenML server, entities such as Stacks, Stack Components, Stack Component Flavors, Pipelines, Pipeline Runs, and artifacts are scoped to a Project and owned by the User that creates them. Only the objects that are owned by the current user used to authenticate to the ZenML server and that are part of the current project are available to the client.\nStacks and Stack Components can also be shared within the same project with other users. To share an object, either set it as shared during creation time (e.g. `zenml stack register mystack ... --share`) or afterwards (e.g. through `zenml stack share mystack`).\nTo differentiate between shared and private Stacks and Stack Components, these can now be addressed by name, id or the first few letters of the id in the cli. E.g. for a stack `default` with id `179ebd25-4c5b-480f-a47c-d4f04e0b6185` you can now run `zenml stack describe default` or `zenml stack describe 179` or `zenml stack describe 179ebd25-4c5b-480f-a47c-d4f04e0b6185`.\nWe also introduce the notion of `local` vs `non-local` stack components. Local stack components are stack components that are configured to run locally while non-local stack components are configured to run remotely or in a cloud environment. Consequently:\n  * stacks made up of local stack components should not be shared on a central ZenML Server, even though this is not enforced by the system.\n  * stacks made up of non-local stack components are only functional if they are shared through a remotely deployed ZenML Server.\n\n\nRead more about shared stacks in the production guide.\n## \nOther changes\n### \nThe `Repository` class is now called `Client`\nThe `Repository` object has been renamed to `Client` to better capture its functionality. You can continue to use the `Repository` object for backwards compatibility, but it will be removed in a future release.\n**How to migrate** : Rename all references to `Repository` in your code to `Client`.\n### \nThe `BaseStepConfig` class is now called `BaseParameters`\nThe `BaseStepConfig` object has been renamed to `BaseParameters` to better capture its functionality. You can NOT continue to use the `BaseStepConfig`.\nThis is part of a broader configuration rehaul which is discussed next.\n**How to migrate** : Rename all references to `BaseStepConfig` in your code to `BaseParameters`.\n### \nConfiguration Rework\nAlongside the architectural shift, Pipeline configuration has been completely rethought. This video gives an overview of how configuration has changed with ZenML in the post ZenML 0.20.0 world.\nConfiguring pipelines, steps, and stack components in ZenML\n**What changed?**\nZenML pipelines and steps could previously be configured in many different ways:\n  * On the `@pipeline` and `@step` decorators (e.g. the `requirements` variable)\n  * In the `__init__` method of the pipeline and step class\n  * Using `@enable_xxx` decorators, e.g. `@enable_mlflow`.\n  * Using specialized methods like `pipeline.with_config(...)` or `step.with_return_materializer(...)`\n\n\nSome of the configuration options were quite hidden, difficult to access and not tracked in any way by the ZenML metadata store.\nWith ZenML 0.20.0, we introduce the `BaseSettings` class, a broad class that serves as a central object to represent all runtime configuration of a pipeline run (apart from the `BaseParameters`).\nPipelines and steps now allow all configurations on their decorators as well as the `.configure(...)` method. This includes configurations for stack components that are not infrastructure-related which was previously done using the `@enable_xxx` decorators). The same configurations can also be defined in a YAML file.\nRead more about this paradigm in the new docs section about settings.\nHere is a list of changes that are the most obvious in consequence of the above code. Please note that this list is not exhaustive, and if we have missed something let us know via Slack.\n**Deprecating the**`**enable_xxx**`**decorators**\nWith the above changes, we are deprecating the much-loved `enable_xxx` decorators, like `enable_mlflow` and `enable_wandb`.\n**How to migrate** : Simply remove the decorator and pass something like this instead to step directly:\nCopy```\n@step(\n    experiment_tracker=\"mlflow_stack_comp_name\",  # name of registered component\n    settings={  # settings of registered component\n        \"experiment_tracker.mlflow\": {  # this is `category`.`flavor`, so another example is `step_operator.spark`\n            \"experiment_name\": \"name\",\n            \"nested\": False\n        }\n    }\n)\n```\n\n**Deprecating**`**pipeline.with_config(...)**`\n**How to migrate** : Replaced with the new `pipeline.run(config_path=...)`.\n**Deprecating**`**step.with_return_materializer(...)**`\n**How to migrate** : Simply remove the `with_return_materializer` method and pass something like this instead to step directly:\nCopy```\n@step(\n  output_materializers=materializer_or_dict_of_materializers_mapped_to_outputs\n)\n```\n\n`**DockerConfiguration**`**is now renamed to**`**DockerSettings**`\n**How to migrate** : Rename `DockerConfiguration` to `DockerSettings` and instead of passing it in the decorator directly with `docker_configuration`, you can use:\nCopy```\nfrom zenml.config import DockerSettings\n@step(settings={\"docker\": DockerSettings(...)})\ndef my_step() -> None:\n  ...\n```\n\nWith this change, all stack components (e.g. Orchestrators and Step Operators) that accepted a `docker_parent_image` as part of its Stack Configuration should now pass it through the `DockerSettings` object.\nRead more here.\n`**ResourceConfiguration**`**is now renamed to**`**ResourceSettings**`\n**How to migrate** : Rename `ResourceConfiguration` to `ResourceSettings` and instead of passing it in the decorator directly with `resource_configuration`, you can use:\nCopy```\nfrom zenml.config import ResourceSettings\n@step(settings={\"resources\": ResourceSettings(...)})\ndef my_step() -> None:\n  ...\n```\n\n**Deprecating the**`**requirements**`**and**`**required_integrations**`**parameters**\nUsers used to be able to pass `requirements` and `required_integrations` directly in the `@pipeline` decorator, but now need to pass them through settings:\n**How to migrate** : Simply remove the parameters and use the `DockerSettings` instead\nCopy```\nfrom zenml.config import DockerSettings\n@step(settings={\"docker\": DockerSettings(requirements=[...], requirements_integrations=[...])})\ndef my_step() -> None:\n  ...\n```\n\nRead more here.\n**A new pipeline intermediate representation**\nAll the aforementioned configurations as well as additional information required to run a ZenML pipelines are now combined into an intermediate representation called `PipelineDeployment`. Instead of the user-facing `BaseStep` and `BasePipeline` classes, all the ZenML orchestrators and step operators now use this intermediate representation to run pipelines and steps.\n**How to migrate** : If you have written a custom orchestrator or step operator, then you should see the new base abstractions (seen in the links). You can adjust your stack component implementations accordingly.\n### \n`PipelineSpec` now uniquely defines pipelines\nOnce a pipeline has been executed, it is represented by a `PipelineSpec` that uniquely identifies it. Therefore, users are no longer able to edit a pipeline once it has been run once. There are now three options to get around this:\n  * Pipeline runs can be created without being associated with a pipeline explicitly: We call these `unlisted` runs. Read more about unlisted runs here.\n  * Pipelines can be deleted and created again.\n  * Pipelines can be given unique names each time they are run to uniquely identify them.\n\n\n**How to migrate** : No code changes, but rather keep in mind the behavior (e.g. in a notebook setting) when quickly iterating over pipelines as experiments.\n### \nNew post-execution workflow\nThe Post-execution workflow has changed as follows:\n  * The `get_pipelines` and `get_pipeline` methods have been moved out of the `Repository` (i.e. the new `Client` ) class and lie directly in the post_execution module now. To use the user has to do:\n\n\nCopy```\nfrom zenml.post_execution import get_pipelines, get_pipeline\n```\n\n  * New methods to directly get a run have been introduced: `get_run` and `get_unlisted_runs` method has been introduced to get unlisted runs.\n\n\nUsage remains largely similar. Please read the new docs for post-execution to inform yourself of what further has changed.\n**How to migrate** : Replace all post-execution workflows from the paradigm of `Repository.get_pipelines` or `Repository.get_pipeline_run` to the corresponding post_execution methods.\n## \n📡Future Changes\nWhile this rehaul is big and will break previous releases, we do have some more work left to do. However we also expect this to be the last big rehaul of ZenML before our 1.0.0 release, and no other release will be so hard breaking as this one. Currently planned future breaking changes are:\n  * Following the metadata store, the secrets manager stack component might move out of the stack.\n  * ZenML `StepContext` might be deprecated.\n\n\n## \n🐞 Reporting Bugs\nWhile we have tried our best to document everything that has changed, we realize that mistakes can be made and smaller changes overlooked. If this is the case, or you encounter a bug at any time, the ZenML core team and community are available around the clock on the growing Slack community.\nFor bug reports, please also consider submitting a GitHub Issue.\nLastly, if the new changes have left you desiring a feature, then consider adding it to our public feature voting board. Before doing so, do check what is already on there and consider upvoting the features you desire the most.\nPreviousMigration guideNextMigration guide 0.23.0 → 0.30.0\nLast updated 7 months ago\nWas this helpful?\nThis site uses cookies to deliver its service and to analyze traffic. By browsing this site, you accept the privacy policy.\nAcceptReject\n",
    "summary": "## TL;DR Summary of ZenML Migration Guide (0.13.2 → 0.20.0)\n\n### Overview\nZenML 0.20.0 introduces significant architectural changes, including the removal of the Metadata Store as a separate component, now integrated into ZenML itself. This guide provides migration instructions for existing stacks and pipelines.\n\n### Key Changes\n- **Metadata Store Role**: ZenML now manages all metadata directly, requiring migration from previous stores.\n- **ZenML Dashboard**: A new dashboard is available for managing deployments.\n- **Profiles Removal**: ZenML Profiles are replaced by Projects; manual migration is necessary.\n- **Decoupled Configuration**: Stack component configuration is now separate from implementation.\n- **CLI Commands**: New commands for managing the ZenML server and pipelines.\n\n### Migration Steps\n1. Backup existing metadata.\n2. Upgrade to ZenML 0.20.0.\n3. Use `zenml pipeline runs migrate` for existing runs.\n4. Migrate Profiles using `zenml profile migrate`.\n\n### Future Changes\nFurther breaking changes are anticipated before the 1.0.0 release, including potential adjustments to the secrets manager and deprecation of `StepContext`. \n\nFor detailed migration steps and command usage, refer to the full documentation.",
    "content_quality_score": null,
    "child_urls": [
        "https://docs.zenml.io/",
        "https://zenml.io",
        "https://zenml.io/slack",
        "https://cloud.zenml.io/signup",
        "https://docs.zenml.io/user-guides",
        "https://docs.zenml.io/pro",
        "https://docs.zenml.io/stacks",
        "https://docs.zenml.io/api-reference",
        "https://docs.zenml.io/sdk-reference",
        "https://docs.zenml.io/changelog",
        "https://docs.zenml.io/getting-started/installation",
        "https://docs.zenml.io/getting-started/hello-world",
        "https://docs.zenml.io/getting-started/your-first-ai-pipeline",
        "https://docs.zenml.io/getting-started/core-concepts",
        "https://docs.zenml.io/getting-started/system-architectures",
        "https://docs.zenml.io/deploying-zenml/deploying-zenml",
        "https://docs.zenml.io/deploying-zenml/connecting-to-zenml",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/best-practices-upgrading-zenml",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/using-zenml-server-in-prod",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/troubleshoot-your-deployed-server",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/migration-guide",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/migration-guide/migration-zero-twenty",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/migration-guide/migration-zero-thirty",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/migration-guide/migration-zero-forty",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server/migration-guide/migration-zero-sixty",
        "https://docs.zenml.io/concepts/steps_and_pipelines",
        "https://docs.zenml.io/concepts/artifacts",
        "https://docs.zenml.io/concepts/stack_components",
        "https://docs.zenml.io/concepts/service_connectors",
        "https://docs.zenml.io/concepts/snapshots",
        "https://docs.zenml.io/concepts/deployment",
        "https://docs.zenml.io/concepts/containerization",
        "https://docs.zenml.io/concepts/code-repositories",
        "https://docs.zenml.io/concepts/secrets",
        "https://docs.zenml.io/concepts/environment-variables",
        "https://docs.zenml.io/concepts/tags",
        "https://docs.zenml.io/concepts/metadata",
        "https://docs.zenml.io/concepts/models",
        "https://docs.zenml.io/concepts/dashboard-features",
        "https://docs.zenml.io/concepts/templates",
        "https://docs.zenml.io/reference/community-and-content",
        "https://docs.zenml.io/reference/environment-variables",
        "https://docs.zenml.io/reference/llms-txt",
        "https://docs.zenml.io/reference/faq",
        "https://docs.zenml.io/reference/global-settings",
        "https://docs.zenml.io/reference/legacy-docs",
        "https://docs.zenml.io/deploying-zenml",
        "https://docs.zenml.io/getting-started/deploying-zenml",
        "https://docs.zenml.io/user-guides/starter-guide",
        "https://docs.zenml.io//how-to/infrastructure-deployment/stack-deployment/implement-a-custom-stack-component",
        "https://docs.zenml.io/user-guides/production-guide/understand-stacks",
        "https://docs.zenml.io/concepts/steps_and_pipelines/configuration",
        "https://docs.zenml.io//how-to/customize-docker-builds/docker-settings-on-a-pipeline",
        "https://docs.zenml.io//how-to/customize-docker-builds",
        "https://docs.zenml.io/user-guides/best-practices/keep-your-dashboard-server-clean",
        "https://docs.zenml.io/user-guides/tutorial/fetching-pipelines",
        "https://zenml.io/discussion",
        "https://www.zenml.io/privacy-policy",
        "https://github.com/zenml-io/zenml",
        "https://www.gitbook.com/",
        "https://github.com/zenml-io/zenml-dashboard",
        "https://github.com/zenml-io/zenml/pull/895",
        "https://github.com/zenml-io/zenml/issues/new/choose"
    ]
}