{
    "id": "ade2fcc00cdcfac1a5ce5e81cf4cfe13",
    "metadata": {
        "id": "ade2fcc00cdcfac1a5ce5e81cf4cfe13",
        "url": "https://docs.zenml.io/getting-started/system-architectures",
        "title": "System Architecture | ZenML - Bridging the gap between ML & Ops",
        "properties": {
            "description": "Different variations of the ZenML architecture depending on your needs.",
            "keywords": null,
            "author": null,
            "og:title": "System Architecture | ZenML - Bridging the gap between ML & Ops",
            "og:description": "Different variations of the ZenML architecture depending on your needs.",
            "og:image": "https://docs.zenml.io/~gitbook/ogimage/3jWasvWDbN8OLQMbHsEr",
            "twitter:card": "summary_large_image",
            "twitter:title": "System Architecture | ZenML - Bridging the gap between ML & Ops",
            "twitter:description": "Different variations of the ZenML architecture depending on your needs.",
            "twitter:image": "https://docs.zenml.io/~gitbook/ogimage/3jWasvWDbN8OLQMbHsEr"
        }
    },
    "content": "`⌘``k`\nGitBook Assistant\nProductResourcesGitHubStart free\nMore\n  * Documentation\n  * Learn\n  * ZenML Pro\n  * Stacks\n  * API Reference\n  * SDK Reference\n  * Changelog\n\n\nGitBook Assistant\nGitBook Assistant\nWorking...Thinking...\nGitBook Assistant\n##### Good afternoon\nI'm here to help you with the docs.\nWhat is this page about?What should I read next?Can you give an example?\n`⌘``i`\nAI Based on your context\nSend\n  * Getting Started\n    *     *     *     *     *     *   * Deploying ZenML\n    *     *     *   * Concepts\n    *     *     *     *     *     *     *     *     *     *     *     *     *     *     *   * Reference\n    *     *     *     *     *     * \n\nPowered by GitBook\n  * ZenML OSS (Self-hosted)\n  * ZenML Pro (SaaS or Self-hosted)\n  * ZenML Pro SaaS Architecture\n  * ZenML Pro Hybrid SaaS\n  * ZenML Pro Self-Hosted Architecture\n  * Data Implications Across Deployment Scenarios\n\n\nWas this helpful?\nGitBook AssistantAsk\n  1. Getting Started\n\n\nDifferent variations of the ZenML architecture depending on your needs.\nThis guide walks through the various ways that ZenML can be deployed, from self-hosted OSS to SaaS to self-hosted ZenML Pro!\n## \nZenML OSS (Self-hosted)\nThis page is intended as a high-level overview. To learn more about how to deploy ZenML OSS, read this guide.\nA ZenML OSS deployment consists of the following moving pieces:\n  * **ZenML OSS Server** : This is a FastAPI app that manages metadata of pipelines, artifacts, stacks, etc. Note: In ZenML Pro, the notion of a ZenML server is replaced with what is known as a \"Workspace\". For all intents and purposes, consider a ZenML Workspace to be a ZenML OSS server that comes with more functionality.\n  * **OSS Metadata Store** : This is where all ZenML workspace metadata is stored, including ML metadata such as tracking and versioning information about pipelines and models.\n  * **OSS Dashboard** : This is a ReactJS app that shows pipelines, runs, etc.\n  * **Secrets Store** : All secrets and credentials required to access customer infrastructure services are stored in a secure secrets store. The ZenML Pro API has access to these secrets and uses them to access customer infrastructure services on behalf of the ZenML Pro. The secrets store can be hosted either by the ZenML Pro or by the customer.\n\n\nZenML OSS server deployment architecture\nZenML OSS is free with Apache 2.0 license. Learn how to deploy it here.\nTo learn more about the core concepts for ZenML OSS, go here.\n## \nZenML Pro (SaaS or Self-hosted)\nIf you're interested in assessing ZenML Pro SaaS, you can create a free account.\nIf you would like to self-host ZenML Pro, please book a demo.\nThe above deployment can be augmented with the ZenML Pro components:\n  * **ZenML Pro Control Plane** : This is the central controlling entity of all workspaces.\n  * **Pro Dashboard** : This is a dashboard that builds on top of the OSS dashboard and adds further functionality.\n  * **Pro Metadata Store** : This is a PostgreSQL database where all ZenML Pro-related metadata is stored, such as roles, permissions, teams, and workspace management-related data.\n  * **Pro Add-ons** : These are Python modules injected into the OSS Server for enhanced functionality.\n  * **Identity Provider** : ZenML Pro offers flexible authentication options. In cloud-hosted deployments, it integrates with Auth0, allowing users to log in via social media or corporate credentials. For self-hosted deployments, customers can configure their own identity management solution, with ZenML Pro supporting custom OIDC provider integration. This allows organizations to leverage their existing identity infrastructure for authentication and authorization, whether using the cloud service or deploying on-premises.\n\n\nZenML Pro deployment architecture\nZenML Pro offers many additional features to increase your team's productivity. No matter your specific needs, the hosting options for ZenML Pro range from easy SaaS integration to completely air-gapped deployments on your own infrastructure.\nYou might have noticed that this architecture builds on top of the ZenML OSS system architecture. Therefore, if you already have ZenML OSS deployed, it is easy to enroll it as part of a ZenML Pro deployment!\nThe above components interact with other MLOps stack components, secrets, and data in the following scenarios described below.\nTo learn more about the core concepts for ZenML Pro, go here\n### \nZenML Pro SaaS Architecture\nZenML Pro SaaS deployment with ZenML secret store\nFor the ZenML Pro SaaS deployment case, all ZenML services are hosted on infrastructure hosted by the ZenML Team. Customer secrets and credentials required to access customer infrastructure are stored and managed by the ZenML Pro Control Plane.\nOn the ZenML Pro infrastructure, only ML _metadata_ (e.g. pipeline and model tracking and versioning information) is stored. All the actual ML data artifacts (e.g. data produced or consumed by pipeline steps, logs and visualizations, models) are stored on the customer cloud. This can be set up quite easily by configuring an artifact store with your MLOps stack.\nYour workspace only needs permissions to read from this data to display artifacts on the ZenML dashboard. The workspace also needs direct access to parts of the customer infrastructure services to support dashboard control plane features such as CI/CD, triggering and running pipelines, triggering model deployments and so on.\nThe advantage of this setup is that it is a fully-managed service, and is very easy to get started with. However, for some clients, even some metadata can be sensitive; these clients should refer to the other architecture diagram.\n### \nZenML Pro Hybrid SaaS\nZenML Pro self-hosted deployment\nThe partially self-hosted architecture offers a balanced approach that combines the benefits of cloud-hosted control with on-premises data sovereignty. In this configuration, while the ZenML Pro control plane remains hosted by ZenML (handling user management, authentication, RBAC and global workspace coordination), all other components - including services, data, and secrets - are deployed within your own cloud infrastructure.\nThis hybrid model is particularly well-suited for organizations with:\n  * A centralized MLOps or Platform team responsible for standardizing ML practices\n  * Multiple business units or teams that require autonomy over their data and infrastructure\n  * Strict security requirements where workspaces must operate behind VPN/corporate firewalls\n  * Compliance requirements that mandate keeping sensitive data and ML artifact metadata within company infrastructure\n  * Need for customization of workspace configurations while maintaining centralized governance\n\n\nThe key advantages of this setup include:\n  * Simplified user management through the ZenML-hosted control plane\n  * Complete data sovereignty - sensitive data and ML artifacts remain within your infrastructure\n  * Secure networking - workspaces communicate through outbound-only connections via VPN/private networks\n  * Ability to customize and configure workspaces according to specific team needs\n  * Reduced operational overhead compared to fully self-hosted deployments\n  * Reduced maintenance burden - all control plane updates and maintenance are handled by ZenML This architecture strikes a balance between convenience and control, making it a popular choice for enterprises looking to standardize their MLOps practices while maintaining sovereignty.\n\n\n### \nZenML Pro Self-Hosted Architecture\nZenML Pro self-hosted deployment\nIn the case of self-hosting ZenML Pro, all services, data, and secrets are deployed on the customer cloud. This is meant for customers who require completely air-gapped deployments, for the tightest security standards. Reach out to us if you want to set this up.\nAre you interested in ZenML Pro? Sign up and get access with a free trial now!\n## \nData Implications Across Deployment Scenarios\nDeployment Scenario\nData Location\nData Movement\nData Access\nData Isolation\n**ZenML OSS (Self-hosted)**\nAll data remains on customer infrastructure: both ML metadata in OSS Metadata Store and actual ML data artifacts in customer Artifact Store\nData stays within customer boundary; moves between pipeline steps via the Orchestrator\nAccessible only through customer infrastructure; no ZenML-managed components have access\nComplete data isolation from ZenML-managed services\n**ZenML Pro SaaS**\nML metadata in ZenML-hosted DB; Actual ML data artifacts in customer Artifact Store; Secrets in ZenML-managed Secret Store\nMetadata flows to ZenML Pro Control Plane; ML data artifacts stay on customer infrastructure; ZenML services access customer infrastructure using stored credentials\nZenML Pro has access to the customer secrets that are explicitly stored; Workspace optionally needs read access to artifact store for dashboard display; No actual ML data moves to ZenML infrastructure unless explicitly shared\nOnly metadata and credentials are stored on ZenML infrastructure; actual ML data remains isolated on customer infrastructure\n**ZenML Pro Hybrid SaaS**\nControl Plane on ZenML infrastructure; Workspace, DB, Secret Store, Orchestrator, and Artifact Store on customer infrastructure\nOnly authentication/authorization data flows to ZenML; All ML data and metadata stays on customer infrastructure\nZenML Control Plane has limited access to user management data; No access to actual ML data or metadata; Customer maintains all data access controls\nStrong data isolation with only authentication events crossing boundary. Allows securing access via VPN/private networks.\n**ZenML Pro Self-Hosted**\nAll components run on customer infrastructure\nAll data movement contained within customer infrastructure boundary\nNo external access to any data; completely air-gapped operation possible\nComplete data isolation; ZenML has no access to any customer data\nPreviousCore ConceptsNextDeploy\nLast updated 4 months ago\nWas this helpful?\nThis site uses cookies to deliver its service and to analyze traffic. By browsing this site, you accept the privacy policy.\nAcceptReject\n",
    "summary": null,
    "content_quality_score": null,
    "child_urls": [
        "https://docs.zenml.io/",
        "https://zenml.io",
        "https://zenml.io/slack",
        "https://cloud.zenml.io/signup",
        "https://docs.zenml.io/user-guides",
        "https://docs.zenml.io/pro",
        "https://docs.zenml.io/stacks",
        "https://docs.zenml.io/api-reference",
        "https://docs.zenml.io/sdk-reference",
        "https://docs.zenml.io/changelog",
        "https://docs.zenml.io/getting-started/installation",
        "https://docs.zenml.io/getting-started/hello-world",
        "https://docs.zenml.io/getting-started/your-first-ai-pipeline",
        "https://docs.zenml.io/getting-started/core-concepts",
        "https://docs.zenml.io/getting-started/system-architectures",
        "https://docs.zenml.io/deploying-zenml/deploying-zenml",
        "https://docs.zenml.io/deploying-zenml/connecting-to-zenml",
        "https://docs.zenml.io/deploying-zenml/upgrade-zenml-server",
        "https://docs.zenml.io/concepts/steps_and_pipelines",
        "https://docs.zenml.io/concepts/artifacts",
        "https://docs.zenml.io/concepts/stack_components",
        "https://docs.zenml.io/concepts/service_connectors",
        "https://docs.zenml.io/concepts/snapshots",
        "https://docs.zenml.io/concepts/deployment",
        "https://docs.zenml.io/concepts/containerization",
        "https://docs.zenml.io/concepts/code-repositories",
        "https://docs.zenml.io/concepts/secrets",
        "https://docs.zenml.io/concepts/environment-variables",
        "https://docs.zenml.io/concepts/tags",
        "https://docs.zenml.io/concepts/metadata",
        "https://docs.zenml.io/concepts/models",
        "https://docs.zenml.io/concepts/dashboard-features",
        "https://docs.zenml.io/concepts/templates",
        "https://docs.zenml.io/reference/community-and-content",
        "https://docs.zenml.io/reference/environment-variables",
        "https://docs.zenml.io/reference/llms-txt",
        "https://docs.zenml.io/reference/faq",
        "https://docs.zenml.io/reference/global-settings",
        "https://docs.zenml.io/reference/legacy-docs",
        "https://docs.zenml.io/getting-started",
        "https://zenml.io/pro",
        "https://zenml.io/book-a-demo",
        "https://docs.zenml.io/pro/core-concepts",
        "https://docs.zenml.io/stacks/artifact-stores",
        "https://www.zenml.io/privacy-policy",
        "https://github.com/zenml-io/zenml",
        "https://www.gitbook.com/",
        "https://auth0.com/",
        "mailto:cloud%40zenml.io"
    ]
}